Revit 2024 API
ParameterValuePresenceRule Properties
The ParameterValuePresenceRule type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
Parameter
 The parameter which will be evaluated to pass this rule.
See Also
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace